docs/vim.org
* Conceptos basicos
 1. El primer paso es ir al Evil Mode presionando <kbd>ESC</kbd>, y presionar la tecla dos puntos <kbd>:</kbd>
 2. Seguido a los <kbd>:</kbd> tenemos algunas opciones
    - <kbd>s</kbd> reemplaza la primera palabra que coincida (solo en la linea donde este el cursor)
    - <kbd>%s</kbd><kbd>s</kb> reemplaza la primera palabra que coincida (en cada linea del archivo)
  
 **Observacion:** Evil Mode es la modalidad Vim y el Holy Mode el de emacs
    
 #+BEGIN_EXAMPLE
 :s/actualidad/actualmente
 Reemplazamos la primera palabra que coincida con "actualidad" al comienzo de la linea donde este el cursor,
 y la reemplazamos por "actualmente"

 :s/actualidad/actualmente/g
 Similar al anterior ejemplo, pero reemplaza todas las palabras que coincidan en la linea donde este el cursor
 (es decir no solo la primera que encuentre, si no todas)

 :s/actualidad/actualmente/gc
 Similar al anterior pero nos pide confirmacion al momento de reemplazar
  
 :%s/actualidad/actualmente
 Reemplazamos la primera palabra que coincida con "actualidad" al comienza de cada linea del archivo,
 y la reemplazamos por "actualmente"

 :%s/actualidad/actualmente/g
 Similar al anterior pero reemplaza todas las palabras que coincidan, en todo el archivo (es decir no la primera que encuentre)

 :%s/actualidad/actualmente/gc
 Similar al anterior pero nos pide confirmacion al momento de reemplazar
 #+END_EXAMPLE

 Referencias
 - Guias basicas
   - [[https://www.youtube.com/watch?v=iWo1cDGlNDI][comandos basicos - Ver Video]]
 - Buscar texto y reemplazar con Expresiones Regulares
   - https://hipertextual.com/archivo/2015/01/como-usar-vim-14/
   - https://www.atareao.es/tutorial/vim/buscar-y-reemplazar-en-vim/
   - https://www.imd.guru/sistemas/vim/buscar-y-reemplazar.html
   - https://www.linux.com/training-tutorials/vim-tips-basics-search-and-replace/
 Pendiente
 - https://www.youtube.com/watch?v=8PZZkIr5Dcc
 - https://www.youtube.com/watch?v=jwxK5Eg_TnM
 - https://www.youtube.com/watch?v=OnUiHLYZgaA
   - 
* QuteBrowser - Navegador web con Modo Vim
** Conceptos
   Un grandioso navegador web conocido como *qute browser*
** Atajos
   + No es necesario escribir el comando : (dos puntos) para utilizarlos
   + Para las letras en mayuscula presionar SHIFT+Letra, no funciona con BloqMayus

   |-----------+------------------------------------------------------------------|
   | Atajo     | Descripción                                                      |
   |-----------+------------------------------------------------------------------|
   | i         | Modo Escribir (Insert Mode)                                      |
   | v         | Modo Lectura (Visual Mode)                                       |
   | Escribir  | Modo Normal                                                      |
   |-----------+------------------------------------------------------------------|
   | :         | Listar todos los comandos                                        |
   | r         | Recargar página                                                  |
   | d         | Cierra la pestaña actual                                         |
   | o         | Buscar algo en el Buscador "DuckDuckGo" en la pestaña actual     |
   | O         | Buscar algo en el Buscador "DuckDuckGo" en nueva pestaña         |
   | go        | Abrir una dirección web en la pestaña actual                     |
   | gC        | Clonar pestaña                                                   |
   | <Ctrl-Q>  | Salir                                                            |
   | :q        | Guardar las pestañas abiertas y salir                            |
   |-----------+------------------------------------------------------------------|
   | f         | Muestra etiquetas en la pantalla, simula el click con el teclado |
   | j, k      | Scrollear hacia arriba/abajo                                     |
   | h, l      | Scrollear hacia izquierda/derecha                                |
   | H, L      | Moverse por el historial, a la página anterior/siguiente         |
   | J, K      | Movernos entre las pestañas                                      |
   | <Alt-Num> | Seleccionar una pestaña                                          |
   |-----------+------------------------------------------------------------------|
   | /         | Buscar palabras en la pestaña actual                             |
   | n         | Siguiente búsqueda                                               |
   | N         | Anterior búsqueda                                                |
   | yy        | Copiar url de la pestaña actual                                  |
   | yt        | Copiar el titulo de la pestaña actual                            |
   | pp        | Pegar                                                            |
   |-----------+------------------------------------------------------------------|
   |           |                                                                  |
** Buscador DuckDuckGo
   Es el buscador por defecto de qutebrowser
** Referencias
  - https://qutebrowser.org/doc/help/commands.html
  - https://www.youtube.com/watch?v=nu-YyL7iQC4
  - https://www.youtube.com/watch?v=g2RtjO_jXvY
  - https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/26950-la-nueva-version-de-qutebrowser-1-11-0-ya-esta-aqui-un-navegador-al-estilo-vim.html
  - https://draculatheme.com/qutebrowser
  - https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/27249-qutebrowser-el-navegador-al-estilo-vim-se-actualiza-a-su-nueva-version-1-12-0.html
  - https://ubunlog.com/qutebrowser-navegador-estilo-vim/
  - https://www.xataka.com/basics/duckduckgo-que-principales-diferencias-google
