dist/vim.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-03-31 mié 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>‎</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcbccefa">1. Guia de Vim</a>
<ul>
<li><a href="#orgdda40e1">1.1. Conceptos basicos</a></li>
<li><a href="#org62a2633">1.2. QuteBrowser - Navegador web con Modo Vim</a>
<ul>
<li><a href="#org2aa36ce">1.2.1. Atajos</a></li>
<li><a href="#org9a5b2b2">1.2.2. Buscador DuckDuckGo</a></li>
<li><a href="#orgd30d130">1.2.3. Referencias</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcbccefa" class="outline-2">
<h2 id="orgcbccefa"><span class="section-number-2">1</span> Guia de Vim</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdda40e1" class="outline-3">
<h3 id="orgdda40e1"><span class="section-number-3">1.1</span> Conceptos basicos</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>El primer paso es ir al Evil Mode presionando &lt;kbd&gt;ESC&lt;/kbd&gt;, y presionar la tecla dos puntos &lt;kbd&gt;:&lt;/kbd&gt;</li>
<li>Seguido a los &lt;kbd&gt;:&lt;/kbd&gt; tenemos algunas opciones
<ul class="org-ul">
<li>&lt;kbd&gt;s&lt;/kbd&gt; reemplaza la primera palabra que coincida (solo en la linea donde este el cursor)</li>
<li>&lt;kbd&gt;%s&lt;/kbd&gt;&lt;kbd&gt;s&lt;/kb&gt; reemplaza la primera palabra que coincida (en cada linea del archivo)</li>
</ul></li>
</ol>

<p>
<b><b>Observacion:</b></b> Evil Mode es la modalidad Vim y el Holy Mode el de emacs
</p>

<pre class="example">:s/actualidad/actualmente
Reemplazamos la primera palabra que coincida con "actualidad" al comienzo de la linea donde este el cursor,
y la reemplazamos por "actualmente"

:s/actualidad/actualmente/g
Similar al anterior ejemplo, pero reemplaza todas las palabras que coincidan en la linea donde este el cursor
(es decir no solo la primera que encuentre, si no todas)

:s/actualidad/actualmente/gc
Similar al anterior pero nos pide confirmacion al momento de reemplazar

:%s/actualidad/actualmente
Reemplazamos la primera palabra que coincida con "actualidad" al comienza de cada linea del archivo,
y la reemplazamos por "actualmente"

:%s/actualidad/actualmente/g
Similar al anterior pero reemplaza todas las palabras que coincidan, en todo el archivo (es decir no la primera que encuentre)

:%s/actualidad/actualmente/gc
Similar al anterior pero nos pide confirmacion al momento de reemplazar
</pre>

<p>
Referencias
</p>
<ul class="org-ul">
<li>Guias basicas
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=iWo1cDGlNDI">comandos basicos - Ver Video</a></li>
</ul></li>
<li>Buscar texto y reemplazar con Expresiones Regulares
<ul class="org-ul">
<li><a href="https://hipertextual.com/archivo/2015/01/como-usar-vim-14/">https://hipertextual.com/archivo/2015/01/como-usar-vim-14/</a></li>
<li><a href="https://www.atareao.es/tutorial/vim/buscar-y-reemplazar-en-vim/">https://www.atareao.es/tutorial/vim/buscar-y-reemplazar-en-vim/</a></li>
<li><a href="https://www.imd.guru/sistemas/vim/buscar-y-reemplazar.html">https://www.imd.guru/sistemas/vim/buscar-y-reemplazar.html</a></li>
<li><a href="https://www.linux.com/training-tutorials/vim-tips-basics-search-and-replace/">https://www.linux.com/training-tutorials/vim-tips-basics-search-and-replace/</a></li>
</ul></li>
</ul>
<p>
Pendiente
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=8PZZkIr5Dcc">https://www.youtube.com/watch?v=8PZZkIr5Dcc</a></li>
<li><a href="https://www.youtube.com/watch?v=jwxK5Eg_TnM">https://www.youtube.com/watch?v=jwxK5Eg_TnM</a></li>
<li><a href="https://www.youtube.com/watch?v=OnUiHLYZgaA">https://www.youtube.com/watch?v=OnUiHLYZgaA</a>
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org62a2633" class="outline-3">
<h3 id="org62a2633"><span class="section-number-3">1.2</span> QuteBrowser - Navegador web con Modo Vim</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Un grandioso navegador web conocido como <b>qute browser</b>
</p>
</div>
<div id="outline-container-org2aa36ce" class="outline-4">
<h4 id="org2aa36ce"><span class="section-number-4">1.2.1</span> Atajos</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>No es necesario escribir el comando : (dos puntos) para utilizarlos</li>
<li>Para las letras en mayuscula presionar SHIFT+Letra, no funciona con BloqMayus</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Atajo</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">i</td>
<td class="org-left">Modo Escribir (Insert Mode)</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">Modo Lectura (Visual Mode)</td>
</tr>

<tr>
<td class="org-left">Escribir</td>
<td class="org-left">Modo Normal</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">:</td>
<td class="org-left">Listar todos los comandos</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">Recargar página</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">Cierra la pestaña actual</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">Buscar algo en el Buscador "DuckDuckGo" en la pestaña actual</td>
</tr>

<tr>
<td class="org-left">O</td>
<td class="org-left">Buscar algo en el Buscador "DuckDuckGo" en nueva pestaña</td>
</tr>

<tr>
<td class="org-left">go</td>
<td class="org-left">Abrir una dirección web en la pestaña actual</td>
</tr>

<tr>
<td class="org-left">gC</td>
<td class="org-left">Clonar pestaña</td>
</tr>

<tr>
<td class="org-left">&lt;Ctrl-Q&gt;</td>
<td class="org-left">Salir</td>
</tr>

<tr>
<td class="org-left">:q</td>
<td class="org-left">Guardar las pestañas abiertas y salir</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">Muestra etiquetas en la pantalla, simula el click con el teclado</td>
</tr>

<tr>
<td class="org-left">j, k</td>
<td class="org-left">Scrollear hacia arriba/abajo</td>
</tr>

<tr>
<td class="org-left">h, l</td>
<td class="org-left">Scrollear hacia izquierda/derecha</td>
</tr>

<tr>
<td class="org-left">H, L</td>
<td class="org-left">Moverse por el historial, a la página anterior/siguiente</td>
</tr>

<tr>
<td class="org-left">J, K</td>
<td class="org-left">Movernos entre las pestañas</td>
</tr>

<tr>
<td class="org-left">&lt;Alt-Num&gt;</td>
<td class="org-left">Seleccionar una pestaña</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">Siguiente búsqueda</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">Anterior búsqueda</td>
</tr>

<tr>
<td class="org-left">yy</td>
<td class="org-left">Copiar url de la pestaña actual</td>
</tr>

<tr>
<td class="org-left">yt</td>
<td class="org-left">Copiar el titulo de la pestaña actual</td>
</tr>

<tr>
<td class="org-left">pp</td>
<td class="org-left">Pegar</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9a5b2b2" class="outline-4">
<h4 id="org9a5b2b2"><span class="section-number-4">1.2.2</span> Buscador DuckDuckGo</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Es el buscador por defecto de qutebrowser
</p>
</div>
</div>
<div id="outline-container-orgd30d130" class="outline-4">
<h4 id="orgd30d130"><span class="section-number-4">1.2.3</span> Referencias</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li><a href="https://qutebrowser.org/doc/help/commands.html">https://qutebrowser.org/doc/help/commands.html</a></li>
<li><a href="https://www.youtube.com/watch?v=nu-YyL7iQC4">https://www.youtube.com/watch?v=nu-YyL7iQC4</a></li>
<li><a href="https://www.youtube.com/watch?v=g2RtjO_jXvY">https://www.youtube.com/watch?v=g2RtjO_jXvY</a></li>
<li><a href="https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/26950-la-nueva-version-de-qutebrowser-1-11-0-ya-esta-aqui-un-navegador-al-estilo-vim.html">https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/26950-la-nueva-version-de-qutebrowser-1-11-0-ya-esta-aqui-un-navegador-al-estilo-vim.html</a></li>
<li><a href="https://draculatheme.com/qutebrowser">https://draculatheme.com/qutebrowser</a></li>
<li><a href="https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/27249-qutebrowser-el-navegador-al-estilo-vim-se-actualiza-a-su-nueva-version-1-12-0.html">https://laboratoriolinux.es/index.php/-noticias-mundo-linux-/software/27249-qutebrowser-el-navegador-al-estilo-vim-se-actualiza-a-su-nueva-version-1-12-0.html</a></li>
<li><a href="https://ubunlog.com/qutebrowser-navegador-estilo-vim/">https://ubunlog.com/qutebrowser-navegador-estilo-vim/</a></li>
<li><a href="https://www.xataka.com/basics/duckduckgo-que-principales-diferencias-google">https://www.xataka.com/basics/duckduckgo-que-principales-diferencias-google</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-31 mié 00:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>